/**
 * =============================================================
* @file        DataManager.cpp
 * @author      kinketsu patron (https://kinketsu-patron.com)
 * @brief       データ入出力管理
 * @version     1.0
 * @date        2024-06-08
 * =============================================================
 */

// =======================================================
// ヘッダインクルード
// =======================================================
#include "inc/DataManager.h"

// =======================================================
// 静的変数
// =======================================================
static uint32 mIN_Coin;
static uint32 mOUT_Coin;
static uint32 mRB;
static uint32 mBB;

/**
 * =======================================================
 * @fn          Data_Init
 * @brief       データ管理の初期化を行う
 * @date        2024-06-10
 * =======================================================
 */
void Data_Init( void )
{
        mIN_Coin  = 0U;
        mOUT_Coin = 0U;
        mRB       = 0U;
        mBB       = 0U;
}

/**
 * =======================================================
 * @fn          Data_GetIN
 * @brief       入力枚数を取得する
 * @date        2024-06-10
 * =======================================================
 */
uint32 Data_GetIN ( void ) { return mIN_Coin; }

/**
 * =======================================================
 * @fn          Data_GetOUT
 * @brief       出力枚数を取得する
 * @date        2024-06-10
 * =======================================================
 */
uint32 Data_GetOUT( void ) { return mOUT_Coin; }

/**
 * =======================================================
 * @fn          Data_GetRB
 * @brief       レギュラーボーナス回数を取得する
 * @date        2024-06-10
 * =======================================================
 */
uint32 Data_GetRB ( void ) { return mRB; }

/**
 * =======================================================
 * @fn          Data_GetBB
 * @brief       ビッグボーナス回数を取得する
 * @date        2024-06-10
 * =======================================================
 */
uint32 Data_GetBB ( void ) { return mBB; }

/**
 * =======================================================
 * @fn          Data_SetIN
 * @brief       入力枚数を設定する
 * @date        2024-06-10
 * =======================================================
 */
void Data_SetIN( uint32 pIN_Coin )
{
        if ( pIN_Coin >= 0U )
        {
                mIN_Coin = pIN_Coin;
        }
}

/**
 * =======================================================
 * @fn          Data_SetOUT
 * @brief       出力枚数を設定する
 * @date        2024-06-10
 * =======================================================
 */
void Data_SetOUT( uint32 pOUT_Coin )
{
        if ( pOUT_Coin >= 0U )
        {
                mOUT_Coin = pOUT_Coin;
        }
}

/**
 * =======================================================
 * @fn          Data_SetRB
 * @brief       レギュラーボーナス回数を設定する
 * @date        2024-06-10
 * =======================================================
 */
void Data_SetRB( uint32 pRB )
{
        if ( pRB >= 0U )
        {
                mRB = pRB;
        }
}

/**
 * =======================================================
 * @fn          Data_SetBB
 * @brief       ビッグボーナス回数を設定する
 * @date        2024-06-10
 * =======================================================
 */
void Data_SetBB( uint32 pBB )
{
        if ( pBB >= 0U )
        {
                mBB = pBB;
        }
}