/**
 * =============================================================
 * @file        Serial_Com.cpp
 * @author      kinketsu patron (https://kinketsu-patron.com)
 * @brief       シリアル通信設定
 * @version     1.0
 * @date        2024-06-08
 * =============================================================
 */

// =======================================================
// ヘッダインクルード
// =======================================================
#include "inc/Serial_Com.h"

/**
 * =======================================================
 * @fn         Serial_Init
 * @brief      シリアル通信の初期設定を行う
 * @date       2024-06-08
 * =======================================================
 */
void    Serial_Init( void )
{
        Serial.begin( 9600 );     // PCとのシリアル通信ボーレートを9600bpsに設定
}

/**
 * =======================================================
 * @fn          Serial_Write
 * @brief       シリアル通信でPCにメッセージを送信する
 * @param pMsg  メッセージ前文
 * @param pNum  数値
 * @date        2024-06-12
 * =======================================================
 */
void Serial_Write( const char pMsg[], const uint32 pNum )
{
        Serial.print( pMsg );   // メッセージ前文
        Serial.println( pNum ); // 数値
}